Catalogs/УсловияМаршрутизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>УсловияМаршрутизации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыражениеУсловия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаКомбинацииУсловий</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаУсловия</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОтбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗаданияУсловия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыЗаданияУсловия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/УсловияМаршрутизации/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает структуру полей Условия маршрутизации
//
// Возвращаемое значение:
//   Структура
//     Наименование
//     ТипОбъекта
//     СпособЗаданияУсловия
//     ВыражениеУсловия
//     НастройкаУсловия
//     НастройкаКомбинацииУсловий
//     Ответственный
//     Комментарий
//
Функция ПолучитьСтруктуруУсловияМаршрутизации() Экспорт
	
	СтруктураУсловияМаршрутизации = Новый Структура;
	СтруктураУсловияМаршрутизации.Вставить("Наименование");
	СтруктураУсловияМаршрутизации.Вставить("ТипОбъекта");
	СтруктураУсловияМаршрутизации.Вставить("СпособЗаданияУсловия");
	СтруктураУсловияМаршрутизации.Вставить("ВыражениеУсловия");
	СтруктураУсловияМаршрутизации.Вставить("НастройкаУсловия");
	СтруктураУсловияМаршрутизации.Вставить("НастройкаКомбинацииУсловий");
	СтруктураУсловияМаршрутизации.Вставить("Ответственный");
	СтруктураУсловияМаршрутизации.Вставить("Комментарий");
	
	Возврат СтруктураУсловияМаршрутизации;
	
КонецФункции

// Создает и запсывает в БД условие маршрутизации
//
// Параметры:
//   СтруктураУсловияМаршрутизации - Структура - структура полей условие маршрутизации.
//
// Возвращаемое значение:
//   СправочникСсылка.УсловияМаршрутизации
//
Функция СоздатьУсловиеМаршрутизации(СтруктураУсловияМаршрутизации) Экспорт
	
	НовоеУсловиеМаршрутизации = СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(НовоеУсловиеМаршрутизации, СтруктураУсловияМаршрутизации);
	НовоеУсловиеМаршрутизации.Записать();
	
	Возврат НовоеУсловиеМаршрутизации.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
